import 'package:flutter/material.dart';
import 'package:vartarevarta_magazine/components/colors.dart';

class AboutWidget extends StatefulWidget {
  const AboutWidget({super.key});

  @override
  State<AboutWidget> createState() => _AboutWidgetState();
}

class _AboutWidgetState extends State<AboutWidget> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        centerTitle: true,
        title: const Text("About us"),
        backgroundColor: appBar,
      ),
      body: Scrollable(
        viewportBuilder: (context, position) {
          return ListView(
            children: const [
              SizedBox(
                height: 20,
              ),
              FractionallySizedBox(
                widthFactor: 0.8,
                child: Text(
                  'ચલતે ચલતે.... જંગલમાં અંધારી રાતે તમારે પાણી શોધવાનું હોય તો મશાલ મળે તો સારું.\nરમેશ પારેખે ભલે ખીજવાઈ જઈને રજનીકુમાર પંડ્યાને એમ કહ્યું હોય કે "તું વાર્તાકાર છે એટલે મને કવિતામાં ધકેલે છે અને પેલો અનિલ (જોશી) કવિ છે એટલે મને વાર્તા લખવા કહે છે. તમે બધાં મારાથી ડરો છો". પણ રમેશ પારેખનું એ સદભાગ્ય ગણવું રહ્યું કે એમની પાસે અનિલ જોશી અને રજનીકુમાર પંડ્યા જેવા બે બાઉન્સિંગ પંચ બેગ હતા.\nરે મઠ હોય કે બૌદ્ધ મઠ, -મઠનું માહાત્મ્ય છે. મઠ એટલે સમૂહ, એક ઉદ્દેશને વરેલો સંઘ. વારેવા આપણામાંના રમેશ પારેખને અનિલ જોશી અને રજનીકુમાર પંડ્યા પૂરા પાડવા માટેનો પ્રપંચ છે. એક વારતા મઠ ઉભું કરવાનો પ્રયાસ છે.\nસજીવ માટે જે પ્રાણવાયુની અનિવાર્યતા છે એવી લેખક માટે પ્રતિક્રિયાની અનિવાર્યતા છે. પ્રસંશાથી ફુલાવું કે ટીકાથી કરમાઈ જવું એ લેખનના મુગ્ધાવસ્થાનો તબક્કો છે. અને મોટા ભાગના લેખકો મુગ્ધાવસ્થામાં આજીવન રહે છે. ભલે. પણ જે લેખકો મુગ્ધાવસ્થા પાર કરી લે છે એમનું શું? એમને પ્રતિક્રિયાઓની આવશ્યકતા છે. એમને બે કાન અથવા એક પ્રેક્ષક અથવા એક સાક્ષી અથવા એક પડઘો જરૂરી છે જે પ્રસંશા કે ટીકા તો પછીની વાત પણ એટલું જણાવે કે એના સુધી શું પહોંચે છે! વારેવા મથે છે એવા પ્રતિક્રિયા કેન્દ્ર ઘડાય એ માટે.\nવારેવાની શિબિરોમાં અને ફેસબુક પરની કથાવેધ પ્રવૃત્તિઓમાં સહુ કામ કરતાં કરતાં કામ કેમ કરવું એ શીખી રહ્યાં છીએ. પ્રત્યક્ષ શિબિરોમાં વારતા વાંચન, વારતા લેખનને ઉદ્દીપક એવાં તત્ક્ષણ લેખન પ્રયોગો, વારતા વાંચન, વારતા સંબંધિત લેખ વિશે ચર્ચા, વારતા અન્વયે ફિલ્મ, ટીવી સીરીઝ કે નાટકોની ચર્ચા થતાં હોય છે. ગુજરાતી અને ગુજરાતી સિવાયની ભગિની ભાષાના વારતાકારો ક્યારેક આવી પોતાને સમજાયેલ વારતા તત્વ જૂથના સદસ્યો સાથે વહેંચી જાય છે.અને વારતા લેખન સંબંધિત મૂંઝવણ અને ઉકેલ સહુ પોતપોતાની સમજ અનુસાર એક બીજા સાથે વહેંચે છે. ફેસબુક જુથમાં સંસ્થા દ્વારા આપેલા વિષય પર સદસ્યોની વારતાઓ તેમના નામ વગર જાહેર ચર્ચા માટે મુકાય છે જેથી વારતા કોણે લખી છે તેની સભાનતા વગર જે તે કૃતિની નિષ્પક્ષ ચર્ચા થઇ શકે. અહીં કોઈ વારતા નિષ્ણાંત આપણને એક એક વારતાની એક એક પંક્તિઓ બાબત માર્ગદર્શન આપવા ઉપલબ્ધ નથી – (ક્યારેય નહોતાં). માટે જે માર્ગદર્શન મળશે એ પરસ્પર પ્રત્યાયનથી જ – આપણને આપણા થકી જ મળશે અન્યથા ક્યાંય નહી મળે. કોઈક કાળે વારતા સામાયિકના તંત્રીઓ એટલા વિદ્વાન અને નિસ્બત વાળા હતા કે આપણે મોકલેલી કૃતિ નબળી હોય તો એની વિગત વાર વિવેચના કરી આપણને સુધારણા માટે ફરી મોકલતાં અને આપણામાં રહેલા લેખકને કેળવતાં. અત્યારે તો લેખક તરીકે આપણી કૃતિની નબળાઈથી અજાણ આપણે ‘મારી વારતા છપાઈ’ના કેફમાં ખુદને વારતાકાર માનતા થઈ જઈએ છીએ.\n\nઆવી અભ્યાસશૂન્ય સ્થિતિને કારણે જ આ ગ્રુપનું નિર્માણ થયું છે –જ્યાં કૃતિને નાણવામાં આવે. પણ કૃતિ નાણશે કોણ ? આપણે જ. જેમકે મેં ઉપર સ્પષ્ટ કર્યું : અહીં કોઈ વારતા નિષ્ણાંત આપણને એક એક વારતાની એક એક પંક્તિઓ બાબત માર્ગદર્શન આપવા ઉપલબ્ધ નથી. એટલે આપણે સહુ -વારતા લખવા ઉત્સુક રસિકો અહીં એક બીજાને માર્ગદર્શન આપવા વારેવાના નેજા હેઠળ ભેગા થાય છે. . પણ વારતા કળામાં માર્ગદર્શન આપવાની આપણી લાયકાત શું? કોઈ જ નહિ! શાસ્ત્રીય અભ્યાસ તો આપણો નહીવત છે –તો માર્ગદર્શન કોણ, કોને, કેવી રીતે અને શું આપવાના?\n\n^^^ આમ વિચારી નિરાશ ન થવું. આપણી પાસે એક તત્વ તો ચોક્કસપણે છે જ – એ છે વારતામાં રસ. આપણે કોઈ પણ કૃતિને ભલે શાસ્ત્રીય પદ્ધતિએ ન મુલવી શકીએ પણ વારતામાં રસ હોવાથી રસની દ્રષ્ટીએ તો મુલવી શકીએ જ : શું ગમ્યું – શું ન ગમ્યું – ગમ્યું એ કેમ ગમ્યું અને ન ગમ્યું એ કેમ ન ગમ્યું – એટલું તો કહી જ શકીએ. જો આટલું પણ કહીએ તો લખનારને ચોક્કસ એક દિશા ભાન મળે કે એ લખે છે એ વાચક સુધી કેટલું અને કેવું પહોંચે છે. આ તરીકો કદાચ શ્રેષ્ઠ નથી. પણ અન્ય કોઈ તરીકો જ ન હોય ત્યારે આ એક જ ઉપલબ્ધ તરીકો અપનાવવો રહ્યો. આપણે સહુ વારતા કળા બાબત અંધારામાં છીએ. તો એકલા એકલા ભટકવા કરતાં સાથે ફાંફા મારીએ – એ જ આ વારેવા જૂથનો ઉદ્દેશ. અને એ માટે સમય આપવો રહ્યો. માટે ભલે કંટાળાજનક લાગે, ધીરજ પૂર્વક વાંચી આપણો પ્રામાણિક મત આપવો રહ્યો. કેમકે આ એવું દવાખાનું છે જ્યાં કોઈ ડોક્ટર નથી. તમે અન્યની વારતાની સારવાર કરો – અન્ય તમારી વારતાની સારવાર કરે. અને સારવાર માટે સમય તો આપવો જ રહ્યો.\nવારતા માટે પ્રતિક્રિયા જંગલમાં અંધારી રાતે એ મશાલ જેવા છે જે તમે પાણી તરફ જઈ જ રહ્યા છો કે ભળતી જ દિશામાં એની સુચના આપી શકે. વારેવાનું બળ સંઘ છે, મઠ છે સમૂહ છે, સમાન લક્ષ્યના વારતાવીરોનું જૂથ છે. ૨૦૧૫માં રાજુલ ભાનુશાલીના ઘરે વારેવાની પહેલી બેઠક થઇ હતી. ત્યારથી અત્યાર સુધી વારતા તત્વને સમજવાની મથામણ ચાલી રહી છે, ચાલતી રહેશે. ફેસબુક જૂથ, વ્હોટ્સ એપ જૂથ, બ્લોગ, ટેલીગ્રામ, ઇન્સ્ટાગ્રામ, વેબસાઇટ, વીજાણુ સામયિક, મુદ્રિત સામયિક.... -અને આવનારો સમય જો અન્ય મંચ ઉભા કરે તો તે પણ –વારેવા અપનાવતું રહેશે. કેમકે વારેવા જૂથ આંતરસંવાદમાં માને છે, આંતરસંવાદ માટે મથે છે અને આંતરસંવાદથી જ ટકશે. છ વરસથી ચાલતા આ જુથે કયા ઉદ્દેશથી આ યાત્રા આરંભી એ વિશે આ નાનકડી કેફિયત, જૂથના સૂત્રધાર તરીકે. આ યાત્રા કેટલેક પહોંચી એ તો યાત્રાળુઓ જ કહી શકે. વારેવા વેબસાઇટ યાત્રાળુઓના પ્રવાસ વર્ણનને પ્રકાશિત કરવા ઉત્સુક રહેશે. તો\nચાલતા રહીએ..... રાજુ/ ઓક્ટોબર ૨૧',
                  style: TextStyle(
                    fontSize: 18,
                    fontWeight: FontWeight.bold,
                  ),
                ),
              ),
              SizedBox(
                height: 20,
              ),
            ],
          );
        },
      ),
    );
  }
}
